#رابط التوثيق الرسمي من بايثون حول قيم الصدق
#https://python.org
#ملاحظة عند تطبيقي للبرنامج بدون وضع سلاش كان يعطيني خطا فهنا سالت الذكاء الاصطناعي ووضالسلاشحلي سبب وضع  لحتى نمنع بايثون من خلط الامور والوقوع في اخطاء احببت ان اوضح اني سالت ai في هذه النقطة 

#الحالة الاولى :bool("") التوقع: false
#لان السلسلة النصية فارغة ولا تحتوي على شيء
print(f"bool(\"\") is: {bool("")}")
#الحالة الثانية التوقع : true لان هذه السلسلة ليست فارغة وتحتوي على نص وهو الرمز صفر 
print(f"bool(\"0\") is: {bool('0')}")
#الحالة الثالثة التوقع خطا لان الرقم صفر كعدد صحيح يعبر عن انعدام القيمة  برمجيا 
print(f"bool(0) is: {bool(0)}")
# الحالة الرابعة التوقع false الرقم صفر كعدد عشري يعتبر ايضا قيمة فارغة برمجيا
print(f"bool(0.0) is: {bool(0)}")
#الحالة الخامسة التوقع true لانها سلسلة نصية ومحتوية على نص فهي سليمة من اي خطا 
print(f"bool(\"false\") is: {bool('false')}")

