#truth_research.py
#explores truthy and falsy values in python.
#رابط التوثيق الرسمي من بايثون حول قيم الصدق
#https://python.org
#الحالة الاولى :bool("") التوقع: false
#لان السلسلة النصية فارغة ولا تحتوي على شيء
print(bool(""))
#الحالة الثانية التوقع : true لان هذه السلسلة ليست فارغة وتحتوي على نص وهو الرمز صفر 
print(bool("0"))
#الحالة الثالثة التوقع خطا لان الرقم صفر كعدد صحيح يعبر عن انعدام القيمة  برمجيا 
print(bool(0))
# الحالة الرابعة التوقع false الرقم صفر كعدد عشري يعتبر ايضا قيمة فارغة برمجيا
print(bool(0.0))
#الحالة الخامسة التوقع true لانها سلسلة نصية ومحتوية على نص فهي سليمة من اي خطا 
print(bool("false"))

